[
  {
    "name": "Analog",
    "description": "A web application in which film photography is the central theme in order to promote analog photography. Contains: a login system, remote data source, a blog system, a NonSQL Database, and unit testing usign a React library.",
    "website": "https://project-3ebfb.web.app/",
    "code": "https://github.com/anav-dev/final-project",
    "stack": "React | Google Maps API | Firebase |",
    "background": "This is the final project of the Computing Science Diploma at NCI. This web that enables users to write blog posts as well as to visualise an analog photographer work. Firebase Authentication (Google as provider), Google Maps API, CRUD operations, FireStore Database, and React Testing Library were used and implemented. This platform only includes desktop design as the main focus is the functionality."
  },
  {
    "name": "Anmar",
    "description": "Anmar is a elderly friendly application designed to allow elder people to enjoy all the positive experiences that an online library can offer to end-users through a clearly consistent navigation system and forms, validated form entries, and multiple defined pages. ",
    "website": "https://github.com/anav-dev/react-finalproject-ca2",
    "code": "https://github.com/anav-dev/react-finalproject-ca2",
    "stack": "React | CSS Sass | Axios Library |",
    "background": "A collaborative project of the Advanced Client Side Development module at NCI where a PWA for a specific business was implemented. For this purpose, React, information pulled from a remote data source and information stored in local storage, form validation entries and a defined navigation system were implemented."
  },
  {
    "name": "Embroidery",
    "description": "This website provides information and displays images of hand embroidery basics. Hand Embroidery is a single-page site that can be used by craft lovers who are looking for more information about embroidery. Designed to be responsive, easy to use and navigate, it is intended for people interested in learning more about this art through an enjoyable and appealing visual experience.",
    "website": "https://anav-dev.github.io/hand-embroidery/",
    "code": "https://github.com/anav-dev/hand-embroidery",
    "stack": "HTML | CSS |",
    "background": "This project is the first project of the Full Stack Software Development Diploma at CI. its main goal is to provide reliable content and information about the embroidery art craft via an aesthetically pleasing site using HTML and pure CSS."
  },
  {
    "name": "Game",
    "description": "This is a JavaScript game where the player aims to match as many running objects as possible before running out of time. Runner Crush is a three-page site that can be used by gaming lovers who are looking to unwind in their spare time.",
    "website": "https://github.com/anav-dev/runner-crush",
    "code": "https://github.com/anav-dev/runner-crush",
    "stack": "HTML | CSS | JavaScript",
    "background": "This website's main goal is to provide an opportunity to stimulate the user's mind through an engaging pleasing site using pure JavaScript. It also aims to offer an easy-to-navigate experience for the user through its intuitive and user-friendly design so that users can have an easy experience while having fun."
  },
  {
    "name": "Javathecat",
    "description": "Java the Cat is a site that aims to provide resources and information related to cat fostering, as well as raising public awareness. Fully responsive site so it will adapt and display properly across various devices and screen sizes.",
    "website": "https://nci-marta.github.io/java-the-cat/",
    "code": "https://github.com/anav-dev/WebDesign_Project",
    "stack": "HTML | CSS | JavaScript",
    "background": "Final project for module: Web Design and Client Side Scripting. Responsive website, built in collaboration with: https://github.com/NCI-Marta."
  },
  {
    "name": "Discover",
    "description": "Discover Ireland is a website showcasing different travel destinations in Ireland where users can check the destinations information as well as its current weather.",
    "website": "https://github.com/anav-dev/myfirst-react-projec",
    "code": "https://github.com/anav-dev/myfirst-react-project",
    "stack": "React | API |",
    "background": "First React project using Routing and React Dom, creating and reusing different components. Web application that contains: 4 distinct sections of HTML5, styles controlled by several external CSS file, clearly defined, consistent, navigation system and form, information pull from a data source."
  },
  {
    "name": "Library",
    "description": "A project of Cloud Application Development module. This platform displays a library catalog, allowing users to register, login and check out different books. PHP framework and multiple databases used to build this site.",
    "website": "https://cloudappnci.000webhostapp.com/index.php",
    "code": "https://github.com/anav-dev/CloudApp_finalproject",
    "stack": "PHP | CodeIgniter | phpMyAdmin|",
    "background": "A library website developed by using the framework CodeIgniter. First project with a login system using PHP and multiple databases. Website deployed successfully to the Web host: 000webhost."
  },
  {
    "name": "Weather",
    "description": "The primary purpose of this weather application is to provide users with accurate and up-to-date information about current weather conditions, forecasts, and other relevant meteorological data.",
    "website": "https://github.com/anav-dev/weatherApp",
    "code": "https://github.com/anav-dev/weatherApp",
    "stack": "React | API |",
    "background": "A Weather Forecast App created by using React and Tailwindcss."
  }  
]